[Killed] StringLiteral
src/app/TilePawn/tile-pawn.component.ts:10:28
 })
 export class TilePawnComponent {
   @Input() image: string = '';
-  @Input() style: string = '';
+  @Input() style: string = "Stryker was here!";
   @Input() isDrag: boolean = false;
   @Input() scale: number = 0;
killedBy: MyButtonComponent should create
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] BooleanLiteral
src/app/TilePawn/tile-pawn.component.ts:11:30
 export class TilePawnComponent {
   @Input() image: string = '';
   @Input() style: string = '';
-  @Input() isDrag: boolean = false;
+  @Input() isDrag: boolean = true;
   @Input() scale: number = 0;
   isImg = () => this.image !== '../../assets/img/';
killedBy: MyButtonComponent should create
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/app/TilePawn/tile-pawn.component.ts:13:17
   @Input() style: string = '';
   @Input() isDrag: boolean = false;
   @Input() scale: number = 0;
-  isImg = () => this.image !== '../../assets/img/';
+  isImg = () => true;
 
   getclassbox2dDrag(scale: number) {
killedBy: MyButtonComponent should return false if   image is  empty
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/app/TilePawn/tile-pawn.component.ts:13:17
   @Input() style: string = '';
   @Input() isDrag: boolean = false;
   @Input() scale: number = 0;
-  isImg = () => this.image !== '../../assets/img/';
+  isImg = () => this.image === '../../assets/img/';
 
   getclassbox2dDrag(scale: number) {
killedBy: MyButtonComponent should return true if   image is not empty
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/app/TilePawn/tile-pawn.component.ts:15:36
   @Input() scale: number = 0;
   isImg = () => this.image !== '../../assets/img/';
 
-  getclassbox2dDrag(scale: number) {
-    return scale*100+'px';
-  }
+  getclassbox2dDrag(scale: number) {}
 getclassboxTranslate(scale:number){
     return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
killedBy: MyButtonComponent should return style witdh to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: undefined

[Killed] ArithmeticOperator
src/app/TilePawn/tile-pawn.component.ts:16:12
   isImg = () => this.image !== '../../assets/img/';
 
   getclassbox2dDrag(scale: number) {
-    return scale*100+'px';
+    return scale / 100+'px';
   }
 getclassboxTranslate(scale:number){
killedBy: MyButtonComponent should return style witdh to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: "0.006999999999999999px"

[Killed] StringLiteral
src/app/TilePawn/tile-pawn.component.ts:16:22
   isImg = () => this.image !== '../../assets/img/';
 
   getclassbox2dDrag(scale: number) {
-    return scale*100+'px';
+    return scale*100+"";
   }
 getclassboxTranslate(scale:number){
killedBy: MyButtonComponent should return style witdh to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: "70"

[Killed] BlockStatement
src/app/TilePawn/tile-pawn.component.ts:18:35
   getclassbox2dDrag(scale: number) {
     return scale*100+'px';
   }
-getclassboxTranslate(scale:number){
-    return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
-}
+getclassboxTranslate(scale:number){}
   getclassbtn2dDrag(scale: number) {
     return scale*100+'px';
killedBy: MyButtonComponent should return style translate pawn by style 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-35px,-35px)"
Received: undefined

[Killed] UnaryOperator
src/app/TilePawn/tile-pawn.component.ts:19:27
     return scale*100+'px';
   }
 getclassboxTranslate(scale:number){
-    return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
+    return 'translate(' + +scale * 50 + 'px,' + -scale*50 + 'px)';
 }
   getclassbtn2dDrag(scale: number) {
killedBy: MyButtonComponent should return style translate pawn by style 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-35px,-35px)"
Received: "translate(35px,-35px)"

[Killed] ArithmeticOperator
src/app/TilePawn/tile-pawn.component.ts:19:49
     return scale*100+'px';
   }
 getclassboxTranslate(scale:number){
-    return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
+    return 'translate(' + -scale * 50 + 'px,' + -scale / 50 + 'px)';
 }
   getclassbtn2dDrag(scale: number) {
killedBy: MyButtonComponent should return style translate pawn by style 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-35px,-35px)"
Received: "translate(-35px,-0.013999999999999999px)"

[Killed] BlockStatement
src/app/TilePawn/tile-pawn.component.ts:21:36
 getclassboxTranslate(scale:number){
     return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
 }
-  getclassbtn2dDrag(scale: number) {
-    return scale*100+'px';
-  }
+  getclassbtn2dDrag(scale: number) {}
 }
 
killedBy: MyButtonComponent should return style height to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: undefined

[Killed] ArithmeticOperator
src/app/TilePawn/tile-pawn.component.ts:22:12
     return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
 }
   getclassbtn2dDrag(scale: number) {
-    return scale*100+'px';
+    return scale / 100+'px';
   }
 }
killedBy: MyButtonComponent should return style height to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: "0.006999999999999999px"

[Killed] StringLiteral
src/app/TilePawn/tile-pawn.component.ts:22:22
     return 'translate(' + -scale * 50 + 'px,' + -scale*50 + 'px)';
 }
   getclassbtn2dDrag(scale: number) {
-    return scale*100+'px';
+    return scale*100+"";
   }
 }
killedBy: MyButtonComponent should return style height to set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "70px"
Received: "70"
