[Killed] ArrayDeclaration
qwirkle/src/app/app.component.ts:41:39
   plate: Tile[][] = [[]];
   playTile: RestTilesPlay[] = [];
   swapTile: RestTilesSwap[] = [];
-  score: Rack={code: 1, tilesPlayed : [], newRack: [], points: 0 };
+  score: Rack={code: 1, tilesPlayed : ["Stryker was here"], newRack: [], points: 0 };
   voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
   totalScore = 0;
killedBy: AppComponent should have as title 'qwirkle'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "code": 1,
    "newRack": Array [],

[Killed] BooleanLiteral
qwirkle/src/app/app.component.ts:42:34
   playTile: RestTilesPlay[] = [];
   swapTile: RestTilesSwap[] = [];
   score: Rack={code: 1, tilesPlayed : [], newRack: [], points: 0 };
-  voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
+  voidTile: Tile[] = [{disabled: true, id: 0, shape: 0, color: 0, y: 0, x: 0}];
   totalScore = 0;
   gameId = 0;
killedBy: AppComponent should have as title 'qwirkle'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] ArrayDeclaration
qwirkle/src/app/app.component.ts:42:22
   playTile: RestTilesPlay[] = [];
   swapTile: RestTilesSwap[] = [];
   score: Rack={code: 1, tilesPlayed : [], newRack: [], points: 0 };
-  voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
+  voidTile: Tile[] = [];
   totalScore = 0;
   gameId = 0;
killedBy: AppComponent should have as title 'qwirkle'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "color": 0,

[Killed] ArrayDeclaration
qwirkle/src/app/app.component.ts:53:19
     gamePosition: 0,
     points: 0,
     lastTurnPoints: 0,
-    rack: {tiles: []},
+    rack: {tiles: ["Stryker was here"]},
     isTurn: true
   };
killedBy: AppComponent should reset the paramêtre
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

@@ -5,8 +5,10 @@
    "isTurn": true,
    "lastTurnPoints": 0,

[Killed] BooleanLiteral
qwirkle/src/app/app.component.ts:54:13
     points: 0,
     lastTurnPoints: 0,
     rack: {tiles: []},
-    isTurn: true
+    isTurn: false
   };
   playerNameToPlay: string='';
killedBy: AppComponent should reset the paramêtre
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Object {
    "gameId": 0,

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:56:28
     rack: {tiles: []},
     isTurn: true
   };
-  playerNameToPlay: string='';
+  playerNameToPlay: string="Stryker was here!";
   nameToTurn: string='';
   panzoomModel!: PanZoomModel;
killedBy: AppComponent should have as title 'qwirkle'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] ObjectLiteral
qwirkle/src/app/app.component.ts:73:24
   private panZoomAPI!: PanZoomAPI;
   private apiSubscription!: Subscription;
   players: Player[] = [];
-  games: ListGamedId = {listGameId: []};
+  games: ListGamedId = {};
   private playTileTempory: RestTilesPlay[] = [];
   winner = '';
killedBy: AppComponent should have as title 'qwirkle'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "listGameId": Array [],
- }

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:83:20
 
 
 
-  ngOnInit(): void {
-
-    this.signalRService.startConnection();
-
-    this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {
-      this.receivePlayersInGame(playersIds);
-    });
-    this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
-      this.receiveTilesPlayed(playerId, scoredPoints, tilesPlayed).then();
-    });
-    this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {
-      this.receiveTilesSwapped(playerId);
-    });
-    this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {
-      this.receivePlayerIdTurn(playerId);
-    });
-    this.signalRService.hubConnection.on('ReceiveGameOver', (winnersPlayersIds: number[]) => {
-      this.receiveGameOver(winnersPlayersIds);
-    });
-    this.modelChangedSubscription = this.panzoomConfig.modelChanged.subscribe((model: PanZoomModel) => this.onModelChanged(model));
-    this.apiSubscription = this.panzoomConfig.api.subscribe((api: PanZoomAPI) => this.panZoomAPI = api);
-
-  }
+  ngOnInit(): void {}
 
   onModelChanged(model: PanZoomModel): void {
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:87:89
 
     this.signalRService.startConnection();
 
-    this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {
-      this.receivePlayersInGame(playersIds);
-    });
+    this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {});
     this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
       this.receiveTilesPlayed(playerId, scoredPoints, tilesPlayed).then();
killedBy: test autozoom game should autozoom when game

[Survived] StringLiteral
qwirkle/src/app/app.component.ts:87:42
 
     this.signalRService.startConnection();
 
-    this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {
+    this.signalRService.hubConnection.on("", (playersIds: any[]) => {
       this.receivePlayersInGame(playersIds);
     });

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:90:128
     this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {
       this.receivePlayersInGame(playersIds);
     });
-    this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
-      this.receiveTilesPlayed(playerId, scoredPoints, tilesPlayed).then();
-    });
+    this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {});
     this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {
       this.receiveTilesSwapped(playerId);
killedBy: test autozoom game should autozoom when game

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:90:42
     this.signalRService.hubConnection.on('ReceivePlayersInGame', (playersIds: any[]) => {
       this.receivePlayersInGame(playersIds);
     });
-    this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
+    this.signalRService.hubConnection.on("", (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
       this.receiveTilesPlayed(playerId, scoredPoints, tilesPlayed).then();
     });
killedBy: test autozoom game should autozoom when game

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:93:87
     this.signalRService.hubConnection.on('ReceiveTilesPlayed', (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
       this.receiveTilesPlayed(playerId, scoredPoints, tilesPlayed).then();
     });
-    this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {
-      this.receiveTilesSwapped(playerId);
-    });
+    this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {});
     this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {
       this.receivePlayerIdTurn(playerId);

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:96:87
     this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {
       this.receiveTilesSwapped(playerId);
     });
-    this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {
-      this.receivePlayerIdTurn(playerId);
-    });
+    this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {});
     this.signalRService.hubConnection.on('ReceiveGameOver', (winnersPlayersIds: number[]) => {
       this.receiveGameOver(winnersPlayersIds);
killedBy: test autozoom game should autozoom when game

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:96:42
     this.signalRService.hubConnection.on('ReceiveTilesSwapped', (playerId: number) => {
       this.receiveTilesSwapped(playerId);
     });
-    this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {
+    this.signalRService.hubConnection.on("", (playerId: number) => {
       this.receivePlayerIdTurn(playerId);
     });
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:99:94
     this.signalRService.hubConnection.on('ReceivePlayerIdTurn', (playerId: number) => {
       this.receivePlayerIdTurn(playerId);
     });
-    this.signalRService.hubConnection.on('ReceiveGameOver', (winnersPlayersIds: number[]) => {
-      this.receiveGameOver(winnersPlayersIds);
-    });
+    this.signalRService.hubConnection.on('ReceiveGameOver', (winnersPlayersIds: number[]) => {});
     this.modelChangedSubscription = this.panzoomConfig.modelChanged.subscribe((model: PanZoomModel) => this.onModelChanged(model));
     this.apiSubscription = this.panzoomConfig.api.subscribe((api: PanZoomAPI) => this.panZoomAPI = api);
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:102:79
     this.signalRService.hubConnection.on('ReceiveGameOver', (winnersPlayersIds: number[]) => {
       this.receiveGameOver(winnersPlayersIds);
     });
-    this.modelChangedSubscription = this.panzoomConfig.modelChanged.subscribe((model: PanZoomModel) => this.onModelChanged(model));
+    this.modelChangedSubscription = this.panzoomConfig.modelChanged.subscribe(() => undefined);
     this.apiSubscription = this.panzoomConfig.api.subscribe((api: PanZoomAPI) => this.panZoomAPI = api);
 
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:103:61
       this.receiveGameOver(winnersPlayersIds);
     });
     this.modelChangedSubscription = this.panzoomConfig.modelChanged.subscribe((model: PanZoomModel) => this.onModelChanged(model));
-    this.apiSubscription = this.panzoomConfig.api.subscribe((api: PanZoomAPI) => this.panZoomAPI = api);
+    this.apiSubscription = this.panzoomConfig.api.subscribe(() => undefined);
 
   }
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:107:45
 
   }
 
-  onModelChanged(model: PanZoomModel): void {
-    this.panzoomModel = model;
-    this.scale = this.getCssScale(this.panzoomModel.zoomLevel);
-    this.changeDetector.markForCheck();
-    this.changeDetector.detectChanges();
-  }
+  onModelChanged(model: PanZoomModel): void {}
 
   ngAfterViewInit(): void {
killedBy: AppComponent should change model zoom 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.25
Received: 1

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:114:27
     this.changeDetector.detectChanges();
   }
 
-  ngAfterViewInit(): void {
-    this.resetZoomToFit();
-    this.changeDetector.detectChanges();
-  }
+  ngAfterViewInit(): void {}
 
   resetZoomToFit(): void {
killedBy: AppComponent should resetZoomToFit ngafterviewInit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 0, "width": 0, "x": 0, "y": 0}
Received: undefined

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:119:26
     this.changeDetector.detectChanges();
   }
 
-  resetZoomToFit(): void {
-    const shelveDisplay = document.querySelector('.container') as HTMLElement;
-    const height = shelveDisplay.clientHeight;
-    const width = shelveDisplay.clientWidth;
-    this.panzoomConfig.initialZoomToFit = {
-      x: 0,
-      y: 0,
-      width,
-      height
-    };
-
-
-  }
+  resetZoomToFit(): void {}
 
   receivePlayersInGame = (players: any[]) => {
killedBy: AppComponent should resetZoomToFit ngafterviewInit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 0, "width": 0, "x": 0, "y": 0}
Received: undefined

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:133:46
 
   }
 
-  receivePlayersInGame = (players: any[]) => {
-    players.forEach(player => {
-      console.log('playerId ' + player.playerId + ' is in the game'); // TODO replace log
-    });
-  }
+  receivePlayersInGame = (players: any[]) => {}
 
   receiveTilesPlayed = async (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
killedBy: AppComponent should receivePlayersInGame 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerId 1 is in the game"

Number of calls: 0

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:134:31
   }
 
   receivePlayersInGame = (players: any[]) => {
-    players.forEach(player => {
-      console.log('playerId ' + player.playerId + ' is in the game'); // TODO replace log
-    });
+    players.forEach(player => {});
   }
 
killedBy: AppComponent should receivePlayersInGame 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerId 1 is in the game"

Number of calls: 0

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:135:19
 
   receivePlayersInGame = (players: any[]) => {
     players.forEach(player => {
-      console.log('playerId ' + player.playerId + ' is in the game'); // TODO replace log
+      console.log("" + player.playerId + ' is in the game'); // TODO replace log
     });
   }
killedBy: AppComponent should receivePlayersInGame 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerId 1 is in the game"
Received: "1 is in the game"

Number of calls: 1

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:139:94
     });
   }
 
-  receiveTilesPlayed = async (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {
-    this.game().then();
-
-  }
+  receiveTilesPlayed = async (playerId: number, scoredPoints: number, tilesPlayed: any[]) => {}
 
   receiveTilesSwapped = (playerId: number) => {

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:144:47
 
   }
 
-  receiveTilesSwapped = (playerId: number) => {
-    console.log('player ' + playerId + 'has swapped some tiles'); // TODO replace log
-  }
+  receiveTilesSwapped = (playerId: number) => {}
 
   receivePlayerIdTurn = (playerId: number) => {
killedBy: AppComponent should receiveTilesSwapped 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "player 1has swapped some tiles"
Received: "playerId 1 is in the game"

Number of calls: 1

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:145:40
   }
 
   receiveTilesSwapped = (playerId: number) => {
-    console.log('player ' + playerId + 'has swapped some tiles'); // TODO replace log
+    console.log('player ' + playerId + ""); // TODO replace log
   }
 
killedBy: AppComponent should receiveTilesSwapped 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "player 1has swapped some tiles"
Received
       1: "playerId 1 is in the game"
       2: "Error while starting connection: Error"
       3: "player 1"

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:148:47
     console.log('player ' + playerId + 'has swapped some tiles'); // TODO replace log
   }
 
-  receivePlayerIdTurn = (playerId: number) => {
-    console.log('it\'s playerId ' + playerId + ' turn'); // TODO replace log
-  }
+  receivePlayerIdTurn = (playerId: number) => {}
 
   receiveGameOver = (winnerPlayersIds: number[]) => {
killedBy: AppComponent should receivePlayerIdTurn 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "it's playerId 1 turn"
Received
       1: "playerId 1 is in the game"
       2: "Error while starting connection: Error"
       3: "player 1has swapped some tiles"

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:149:48
   }
 
   receivePlayerIdTurn = (playerId: number) => {
-    console.log('it\'s playerId ' + playerId + ' turn'); // TODO replace log
+    console.log('it\'s playerId ' + playerId + ""); // TODO replace log
   }
 
killedBy: AppComponent should receivePlayerIdTurn 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "it's playerId 1 turn"
Received
       1: "playerId 1 is in the game"
       2: "player 1has swapped some tiles"
       3: "it's playerId 1"

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:152:53
     console.log('it\'s playerId ' + playerId + ' turn'); // TODO replace log
   }
 
-  receiveGameOver = (winnerPlayersIds: number[]) => {
-    winnerPlayersIds.forEach(playerId => {
-      console.log('playerId ' + playerId + ' has win the game'); // TODO replace log
-    });
-  }
+  receiveGameOver = (winnerPlayersIds: number[]) => {}
 
   async autoZoom(): Promise<void> {
killedBy: AppComponent should receiveGameOver 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerId 1 has win the game"
Received
       1: "playerId 1 is in the game"
       2: "Error while starting connection: Error"
       3: "player 1has swapped some tiles"

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:153:42
   }
 
   receiveGameOver = (winnerPlayersIds: number[]) => {
-    winnerPlayersIds.forEach(playerId => {
-      console.log('playerId ' + playerId + ' has win the game'); // TODO replace log
-    });
+    winnerPlayersIds.forEach(playerId => {});
   }
 
killedBy: AppComponent should receiveGameOver 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "playerId 1 has win the game"
Received
       1: "playerId 1 is in the game"
       2: "player 1has swapped some tiles"
       3: "it's playerId 1 turn"

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:163:53
     this.changeDetector.detectChanges();
     const height = this.scene.nativeElement.clientHeight;
     const width = this.scene.nativeElement.clientWidth;
-    const xmin: number = Math.min(...this.board.map(tile => tile.x));
+    const xmin: number = Math.min(...this.board.map(() => undefined));
     const xmax: number = Math.max(...this.board.map(tile => tile.x));
     const ymin = this.getYmin();
killedBy: test autozoom game should autozoom when game

[Survived] ArrowFunction
qwirkle/src/app/app.component.ts:164:53
     const height = this.scene.nativeElement.clientHeight;
     const width = this.scene.nativeElement.clientWidth;
     const xmin: number = Math.min(...this.board.map(tile => tile.x));
-    const xmax: number = Math.max(...this.board.map(tile => tile.x));
+    const xmax: number = Math.max(...this.board.map(() => undefined));
     const ymin = this.getYmin();
     const ymax = this.getYmax();

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:167:9
     const xmax: number = Math.max(...this.board.map(tile => tile.x));
     const ymin = this.getYmin();
     const ymax = this.getYmax();
-    if (ymin >= 0) {
+    if (ymin > 0) {
       if (xmin <= 0) {
 
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:167:9
     const xmax: number = Math.max(...this.board.map(tile => tile.x));
     const ymin = this.getYmin();
     const ymax = this.getYmax();
-    if (ymin >= 0) {
+    if (ymin < 0) {
       if (xmin <= 0) {
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:168:22
     const ymin = this.getYmin();
     const ymax = this.getYmax();
     if (ymin >= 0) {
-      if (xmin <= 0) {
-
-
-        this.panZoomAPI.zoomToFit({
-          x: width/2+200,
-          y: -height,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height
-        });
-
-      } else {
+      if (xmin <= 0) {} else {
 
         this.panZoomAPI.zoomToFit({
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:168:11
     const ymin = this.getYmin();
     const ymax = this.getYmax();
     if (ymin >= 0) {
-      if (xmin <= 0) {
+      if (xmin < 0) {
 
 
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:172:14
 
 
         this.panZoomAPI.zoomToFit({
-          x: width/2+200,
+          x: width / 2 - 200,
           y: -height,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000,
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:172:14
 
 
         this.panZoomAPI.zoomToFit({
-          x: width/2+200,
+          x: width * 2+200,
           y: -height,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000,
killedBy: test autozoom game should autozoom when game

[Killed] UnaryOperator
qwirkle/src/app/app.component.ts:173:14
 
         this.panZoomAPI.zoomToFit({
           x: width/2+200,
-          y: -height,
+          y: +height,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:174:18
         this.panZoomAPI.zoomToFit({
           x: width/2+200,
           y: -height,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000,
+          width: width / (Math.abs(xmax - xmin) * 100) / 1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height
         });
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:174:36
         this.panZoomAPI.zoomToFit({
           x: width/2+200,
           y: -height,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000,
+          width: width * (Math.abs(xmax + xmin) * 100) / 1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height
         });
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:175:19
           x: width/2+200,
           y: -height,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height
+          height: height / (Math.abs(ymax - ymin) * 100) / 600+height
         });
 
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:175:38
           x: width/2+200,
           y: -height,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height
+          height: height * (Math.abs(ymax + ymin) * 100) / 600+height
         });
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:178:14
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height
         });
 
-      } else {
-
-        this.panZoomAPI.zoomToFit({
-          x: 550,
-          y: -400,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
-        });
-      }
+      } else {}
     } else {
 
killedBy: test autozoom game should autozoom when game

[Killed] ObjectLiteral
qwirkle/src/app/app.component.ts:180:35
 
       } else {
 
-        this.panZoomAPI.zoomToFit({
-          x: 550,
-          y: -400,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
-        });
+        this.panZoomAPI.zoomToFit({});
       }
     } else {
killedBy: test autozoom game should autozoom when game with xmax

[Killed] UnaryOperator
qwirkle/src/app/app.component.ts:182:14
 
         this.panZoomAPI.zoomToFit({
           x: 550,
-          y: -400,
+          y: +400,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:183:18
         this.panZoomAPI.zoomToFit({
           x: 550,
           y: -400,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
+          width: width * (Math.abs(xmax - xmin) * 100) * 1000+width/1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
         });
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:183:18
         this.panZoomAPI.zoomToFit({
           x: 550,
           y: -400,
-          width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
+          width: width / (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
         });
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:184:38
           x: 550,
           y: -400,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
+          height: height * (Math.abs(ymax + ymin) * 100) / 600+height/1000
         });
       }
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:184:19
           x: 550,
           y: -400,
           width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-          height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
+          height: height * (Math.abs(ymax - ymin) * 100) / 600 - height / 1000
         });
       }
killedBy: test autozoom game should autozoom when game with xmin

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:187:12
           height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
         });
       }
-    } else {
-
-      this.panZoomAPI.zoomToFit({
-        x: 650,
-        y: -400,
-        width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-        height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
-      });
-    }
+    } else {}
 
 
killedBy: test autozoom game should autozoom when game

[Killed] ObjectLiteral
qwirkle/src/app/app.component.ts:189:33
       }
     } else {
 
-      this.panZoomAPI.zoomToFit({
-        x: 650,
-        y: -400,
-        width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-        height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
-      });
+      this.panZoomAPI.zoomToFit({});
     }
 
killedBy: test autozoom game should autozoom when game

[Killed] UnaryOperator
qwirkle/src/app/app.component.ts:191:12
 
       this.panZoomAPI.zoomToFit({
         x: 650,
-        y: -400,
+        y: +400,
         width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
         height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:193:17
         x: 650,
         y: -400,
         width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-        height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
+        height: height * (Math.abs(ymax - ymin) * 100) * 600+height/1000
       });
     }
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:193:62
         x: 650,
         y: -400,
         width: width * (Math.abs(xmax - xmin) * 100) / 1000+width/1000,
-        height: height * (Math.abs(ymax - ymin) * 100) / 600+height/1000
+        height: height * (Math.abs(ymax - ymin) * 100) / 600+height * 1000
       });
     }
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:203:29
 
   }
 
-  private getYmin(): number {
-    return Math.min(...this.board.map(tile => tile.y));
-  }
+  private getYmin(): number {}
 
   private getYmax(): number {
killedBy: AppComponent should give y min in board style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:204:39
   }
 
   private getYmin(): number {
-    return Math.min(...this.board.map(tile => tile.y));
+    return Math.min(...this.board.map(() => undefined));
   }
 
killedBy: AppComponent should give y min in board style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: NaN

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:207:29
     return Math.min(...this.board.map(tile => tile.y));
   }
 
-  private getYmax(): number {
-    return Math.max(...this.board.map(tile => tile.y));
-  }
+  private getYmax(): number {}
 
   private xmax(): number {
killedBy: AppComponent should give y min in board style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: undefined

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:208:39
   }
 
   private getYmax(): number {
-    return Math.max(...this.board.map(tile => tile.y));
+    return Math.max(...this.board.map(() => undefined));
   }
 
killedBy: AppComponent should give y min in board style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: NaN
