[Survived] BlockStatement
qwirkle/src/app/app.component.ts:211:26
     return Math.max(...this.board.map(tile => tile.y));
   }
 
-  private xmax(): number {
-    return   Math.max(...this.board.map(tile => tile.x));
-  }
+  private xmax(): number {}
 
 

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:212:41
   }
 
   private xmax(): number {
-    return   Math.max(...this.board.map(tile => tile.x));
+    return   Math.max(...this.board.map(() => undefined));
   }
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:217:40
 
 
 
-  getRackTileImage(tile: Tile): string {
-    return '../../assets/img/' + toNameImage(tile);
-  }
+  getRackTileImage(tile: Tile): string {}
 
   getLineStyle(line: Tile[], i: number): string {
killedBy: test autozoom game should autozoom when game

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:218:12
 
 
   getRackTileImage(tile: Tile): string {
-    return '../../assets/img/' + toNameImage(tile);
+    return "" + toNameImage(tile);
   }
 
killedBy: test autozoom game should autozoom when game with xmin

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:221:49
     return '../../assets/img/' + toNameImage(tile);
   }
 
-  getLineStyle(line: Tile[], i: number): string {
-    if (line[0] !== undefined) {
-      return 'translate(' + 0 + 'px,' + i * 100 + 'px)';
-    }
-    return ''
-  }
+  getLineStyle(line: Tile[], i: number): string {}
 
   drop(event: CdkDragDrop<Tile[], any>, index: number): void {
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:222:9
   }
 
   getLineStyle(line: Tile[], i: number): string {
-    if (line[0] !== undefined) {
+    if (line[0] === undefined) {
       return 'translate(' + 0 + 'px,' + i * 100 + 'px)';
     }
killedBy: AppComponent should give y min in board style

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:222:9
   }
 
   getLineStyle(line: Tile[], i: number): string {
-    if (line[0] !== undefined) {
+    if (false) {
       return 'translate(' + 0 + 'px,' + i * 100 + 'px)';
     }
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:223:41
 
   getLineStyle(line: Tile[], i: number): string {
     if (line[0] !== undefined) {
-      return 'translate(' + 0 + 'px,' + i * 100 + 'px)';
+      return 'translate(' + 0 + 'px,' + i / 100 + 'px)';
     }
     return ''
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:233:9
     this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex],
       this.plate[index][event.currentIndex].x, this.plate[index][event.currentIndex].y),this.plate[index][event.currentIndex].x);
 
-    if (event.previousContainer !== event.container) {
+    if (true) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
       this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:233:9
     this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex],
       this.plate[index][event.currentIndex].x, this.plate[index][event.currentIndex].y),this.plate[index][event.currentIndex].x);
 
-    if (event.previousContainer !== event.container) {
+    if (false) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
       this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:234:44
       this.plate[index][event.currentIndex].x, this.plate[index][event.currentIndex].y),this.plate[index][event.currentIndex].x);
 
     if (event.previousContainer !== event.container) {
-      this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.rack = this.rack.filter(tile => false);
       this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
 
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:234:44
       this.plate[index][event.currentIndex].x, this.plate[index][event.currentIndex].y),this.plate[index][event.currentIndex].x);
 
     if (event.previousContainer !== event.container) {
-      this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.rack = this.rack.filter(tile => true);
       this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
 
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:235:42
 
     if (event.previousContainer !== event.container) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-      this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.bag = this.bag.filter(tile => false);
 
     }
killedBy: test autozoom game should autozoom when game with xmin

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:235:42
 
     if (event.previousContainer !== event.container) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-      this.bag = this.bag.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.bag = this.bag.filter(tile => true);
 
     }
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:245:56
       newRack: [],
       points: 0
     };
-    this.playTileTempory = fromBoard(this.board.filter(tile => tile.disabled), this.player.id);
+    this.playTileTempory = fromBoard(this.board.filter(() => undefined), this.player.id);
     this.serviceQwirkle.playTileSimulation(this.playTileTempory).then(async (resp) => {
       this.score = resp;
killedBy: test autozoom game should autozoom when game

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:246:87
       points: 0
     };
     this.playTileTempory = fromBoard(this.board.filter(tile => tile.disabled), this.player.id);
-    this.serviceQwirkle.playTileSimulation(this.playTileTempory).then(async (resp) => {
-      this.score = resp;
-      this.autoZoom().then();
-    });
+    this.serviceQwirkle.playTileSimulation(this.playTileTempory).then(async (resp) => {});
 
 

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:255:52
 
     }
 
-  dropempty(event: CdkDragDrop<Tile[], any>): void {
-    this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex], 0, 0),0);
-    if (event.previousContainer !== event.container) {
-      this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-
-
-    }
-
-    this.plate = toPlate(this.board);
-    this.autoZoom().then();
-
-  }
+  dropempty(event: CdkDragDrop<Tile[], any>): void {}
 
 
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:257:9
 
   dropempty(event: CdkDragDrop<Tile[], any>): void {
     this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex], 0, 0),0);
-    if (event.previousContainer !== event.container) {
+    if (event.previousContainer === event.container) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
 
killedBy: test autozoom game should autozoom when game with xmin

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:257:9
 
   dropempty(event: CdkDragDrop<Tile[], any>): void {
     this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex], 0, 0),0);
-    if (event.previousContainer !== event.container) {
+    if (false) {
       this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
 
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:258:44
   dropempty(event: CdkDragDrop<Tile[], any>): void {
     this.board = insertPosition(this.board, getInsertTile(event.previousContainer.data[event.previousIndex], 0, 0),0);
     if (event.previousContainer !== event.container) {
-      this.rack = this.rack.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.rack = this.rack.filter(tile => tile === event.previousContainer.data[event.previousIndex]);
 
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:273:75
 
 
 
-    this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe(res => {
-      this.nameToTurn = '';
-      if (this.winner === ''){this.nameToTurn = res; }
-    });
+    this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe(res => {});
 
 
killedBy: test autozoom game should autozoom when game

[Killed] StringLiteral
qwirkle/src/app/app.component.ts:274:25
 
 
     this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe(res => {
-      this.nameToTurn = '';
+      this.nameToTurn = "Stryker was here!";
       if (this.winner === ''){this.nameToTurn = res; }
     });
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:275:11
 
     this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe(res => {
       this.nameToTurn = '';
-      if (this.winner === ''){this.nameToTurn = res; }
+      if (true){this.nameToTurn = res; }
     });
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:275:30
 
     this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe(res => {
       this.nameToTurn = '';
-      if (this.winner === ''){this.nameToTurn = res; }
+      if (this.winner === ''){}
     });
 
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:279:61
     });
 
 
-    this.serviceQwirkle.getGames(this.gameId).then(board => {
-       this.board = board.boards;
-       this.plate = toPlate(this.board);
-       board.players.sort((a, b) => a.id - b.id);
-       this.players = board.players
-       this.player = board.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
-
-      this.rack = toRarrange(this.player.rack.tiles);
-       this.autoZoom();
-
-    });
+    this.serviceQwirkle.getGames(this.gameId).then(board => {});
 
 
killedBy: test autozoom game should autozoom when game with xmin

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:282:37
     this.serviceQwirkle.getGames(this.gameId).then(board => {
        this.board = board.boards;
        this.plate = toPlate(this.board);
-       board.players.sort((a, b) => a.id - b.id);
+       board.players.sort((a, b) => a.id + b.id);
        this.players = board.players
        this.player = board.players.filter(player => player.id === this.player.id)[0];
killedBy: test autozoom game should autozoom when game

[Survived] ArrowFunction
qwirkle/src/app/app.component.ts:282:27
     this.serviceQwirkle.getGames(this.gameId).then(board => {
        this.board = board.boards;
        this.plate = toPlate(this.board);
-       board.players.sort((a, b) => a.id - b.id);
+       board.players.sort(() => undefined);
        this.players = board.players
        this.player = board.players.filter(player => player.id === this.player.id)[0];

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:284:53
        this.plate = toPlate(this.board);
        board.players.sort((a, b) => a.id - b.id);
        this.players = board.players
-       this.player = board.players.filter(player => player.id === this.player.id)[0];
+       this.player = board.players.filter(player => false)[0];
       this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
 
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:284:53
        this.plate = toPlate(this.board);
        board.players.sort((a, b) => a.id - b.id);
        this.players = board.players
-       this.player = board.players.filter(player => player.id === this.player.id)[0];
+       this.player = board.players.filter(player => player.id !== this.player.id)[0];
       this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
 
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:285:35
        board.players.sort((a, b) => a.id - b.id);
        this.players = board.players
        this.player = board.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+      this.player.rack.tiles.sort(() => undefined);
 
       this.rack = toRarrange(this.player.rack.tiles);
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:285:45
        board.players.sort((a, b) => a.id - b.id);
        this.players = board.players
        this.player = board.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+      this.player.rack.tiles.sort((a, b) => a.rackPosition + b.rackPosition);
 
       this.rack = toRarrange(this.player.rack.tiles);
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:296:32
 
   }
 
-  async valid(): Promise<void> {
-    this.playTile = fromBoard(this.board.filter(tile => tile.disabled), this.player.id);
-    this.serviceQwirkle.playTile(this.playTile).then(async (resp) => {
-        this.score = resp;
-
-        this.getPlayerIdToPlay().then();
-        this.game().then();
-        this.score = {
-        code: 1,
-        tilesPlayed: [],
-        newRack: [],
-        points: 0
-      };
-      }
-    );
-
-  }
+  async valid(): Promise<void> {}
 
 
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:297:49
   }
 
   async valid(): Promise<void> {
-    this.playTile = fromBoard(this.board.filter(tile => tile.disabled), this.player.id);
+    this.playTile = fromBoard(this.board.filter(() => undefined), this.player.id);
     this.serviceQwirkle.playTile(this.playTile).then(async (resp) => {
         this.score = resp;
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:298:70
 
   async valid(): Promise<void> {
     this.playTile = fromBoard(this.board.filter(tile => tile.disabled), this.player.id);
-    this.serviceQwirkle.playTile(this.playTile).then(async (resp) => {
-        this.score = resp;
-
-        this.getPlayerIdToPlay().then();
-        this.game().then();
-        this.score = {
-        code: 1,
-        tilesPlayed: [],
-        newRack: [],
-        points: 0
-      };
-      }
+    this.serviceQwirkle.playTile(this.playTile).then(async (resp) => {}
     );
 
killedBy: test autozoom game should autozoom when game

[Survived] ArrayDeclaration
qwirkle/src/app/app.component.ts:305:22
         this.game().then();
         this.score = {
         code: 1,
-        tilesPlayed: [],
+        tilesPlayed: ["Stryker was here"],
         newRack: [],
         points: 0

[Survived] ArrayDeclaration
qwirkle/src/app/app.component.ts:306:18
         this.score = {
         code: 1,
         tilesPlayed: [],
-        newRack: [],
+        newRack: ["Stryker was here"],
         points: 0
       };

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:316:36
 
 
 
-  async swapTiles(): Promise<void> {
-    this.swapTile = fromBag(this.bag.filter(tile => tile.disabled), this.player.id);
-    this.serviceQwirkle.swapTile(this.swapTile).then((resp) => {
-        this.game().then();
-        this.getPlayerIdToPlay().then();
-        this.bag=[];
-      }
-    );
-  }
+  async swapTiles(): Promise<void> {}
 
   async skipTurn(): Promise<void> {
killedBy: test autozoom game should autozoom when game with xmax

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:317:45
 
 
   async swapTiles(): Promise<void> {
-    this.swapTile = fromBag(this.bag.filter(tile => tile.disabled), this.player.id);
+    this.swapTile = fromBag(this.bag.filter(() => undefined), this.player.id);
     this.serviceQwirkle.swapTile(this.swapTile).then((resp) => {
         this.game().then();
killedBy: test autozoom game should autozoom when game

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:318:64
 
   async swapTiles(): Promise<void> {
     this.swapTile = fromBag(this.bag.filter(tile => tile.disabled), this.player.id);
-    this.serviceQwirkle.swapTile(this.swapTile).then((resp) => {
-        this.game().then();
-        this.getPlayerIdToPlay().then();
-        this.bag=[];
-      }
+    this.serviceQwirkle.swapTile(this.swapTile).then((resp) => {}
     );
   }

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:326:35
     );
   }
 
-  async skipTurn(): Promise<void> {
-    this.serviceQwirkle.skipTurn(this.player.id).then((resp) => {
-        this.game().then();
-        this.getPlayerIdToPlay().then();
-      }
-    );
-  }
+  async skipTurn(): Promise<void> {}
 
   dropResult(event: CdkDragDrop<Tile[]>): void {
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:327:65
   }
 
   async skipTurn(): Promise<void> {
-    this.serviceQwirkle.skipTurn(this.player.id).then((resp) => {
-        this.game().then();
-        this.getPlayerIdToPlay().then();
-      }
+    this.serviceQwirkle.skipTurn(this.player.id).then((resp) => {}
     );
   }
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:335:9
   }
 
   dropResult(event: CdkDragDrop<Tile[]>): void {
-    if (event.previousContainer === event.container) {
+    if (false) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
 
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:335:9
   }
 
   dropResult(event: CdkDragDrop<Tile[]>): void {
-    if (event.previousContainer === event.container) {
+    if (true) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
 
killedBy: test autozoom game should autozoom when game

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:338:12
     if (event.previousContainer === event.container) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
 
-    } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-      transferArrayItem(event.previousContainer.data,
-        event.container.data,
-        event.previousIndex,
-        event.currentIndex);
-      this.plate = toPlate(this.board);
-
-
-
-    }
+    } else {}
     this.rack=toRarrangeRack(event.container.data)
     this.player.rack.tiles = toTiles(this.rack);

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:339:46
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
 
     } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.board = this.board.filter(tile => true);
       transferArrayItem(event.previousContainer.data,
         event.container.data,
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:339:38
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
 
     } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.board = this.board.filter(() => undefined);
       transferArrayItem(event.previousContainer.data,
         event.container.data,
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:352:9
     this.rack=toRarrangeRack(event.container.data)
     this.player.rack.tiles = toTiles(this.rack);
 
-    if (this.rack.length === 6){
+    if (true){
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:352:9
     this.rack=toRarrangeRack(event.container.data)
     this.player.rack.tiles = toTiles(this.rack);
 
-    if (this.rack.length === 6){
+    if (false){
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
killedBy: test autozoom game should autozoom when game with xmin

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:353:91
     this.player.rack.tiles = toTiles(this.rack);
 
     if (this.rack.length === 6){
-    this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
-      this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
-      this.player = this.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
-      this.rack = toRarrange(this.player.rack.tiles);
-      console.log(this.player.rack.tiles)
-      this.changeDetector.detectChanges();});
-    })); }
+    this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {})); }
   }
 

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:354:63
 
     if (this.rack.length === 6){
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
-      this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
-      this.player = this.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
-      this.rack = toRarrange(this.player.rack.tiles);
-      console.log(this.player.rack.tiles)
-      this.changeDetector.detectChanges();});
+      this.serviceQwirkle.getGames(this.gameId).then(board => {});
     })); }
   }
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:355:51
     if (this.rack.length === 6){
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
-      this.player = this.players.filter(player => player.id === this.player.id)[0];
+      this.player = this.players.filter(player => false)[0];
       this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
       this.rack = toRarrange(this.player.rack.tiles);
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:355:41
     if (this.rack.length === 6){
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
-      this.player = this.players.filter(player => player.id === this.player.id)[0];
+      this.player = this.players.filter(() => undefined)[0];
       this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
       this.rack = toRarrange(this.player.rack.tiles);
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:356:45
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
       this.player = this.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+      this.player.rack.tiles.sort((a, b) => a.rackPosition + b.rackPosition);
       this.rack = toRarrange(this.player.rack.tiles);
       console.log(this.player.rack.tiles)
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:356:35
     this.serviceQwirkle.rackChangeOrder(toTileviewModel(this.player)).then((async rack => {
       this.serviceQwirkle.getGames(this.gameId).then(board => {this.players = board.players
       this.player = this.players.filter(player => player.id === this.player.id)[0];
-      this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+      this.player.rack.tiles.sort(() => undefined);
       this.rack = toRarrange(this.player.rack.tiles);
       console.log(this.player.rack.tiles)
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:371:63
     this.serviceQwirkle.getGames(this.gameId).then(board => {
       this.players = board.players;
 
-      this.serviceQwirkle.getWinners(this.gameId).then(res => {
-          this.winner = '';
-          if (res !== null){
-        this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;
-        this.nameToTurn = '';
-        }
-        });
+      this.serviceQwirkle.getWinners(this.gameId).then(res => {});
 
         this.serviceQwirkle.getPlayer(gameId, this.userId).then((result) => {
killedBy: test autozoom game should autozoom when game with xmin

[Survived] StringLiteral
qwirkle/src/app/app.component.ts:372:25
       this.players = board.players;
 
       this.serviceQwirkle.getWinners(this.gameId).then(res => {
-          this.winner = '';
+          this.winner = "Stryker was here!";
           if (res !== null){
         this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:373:15
 
       this.serviceQwirkle.getWinners(this.gameId).then(res => {
           this.winner = '';
-          if (res !== null){
+          if (false){
         this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;
         this.nameToTurn = '';
killedBy: test autozoom game should autozoom when game

[Killed] EqualityOperator
qwirkle/src/app/app.component.ts:373:15
 
       this.serviceQwirkle.getWinners(this.gameId).then(res => {
           this.winner = '';
-          if (res !== null){
+          if (res === null){
         this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;
         this.nameToTurn = '';
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:374:54
       this.serviceQwirkle.getWinners(this.gameId).then(res => {
           this.winner = '';
           if (res !== null){
-        this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;
+        this.winner = board.players.filter(player => false)[0].pseudo;
         this.nameToTurn = '';
         }
killedBy: test autozoom game should autozoom when game

[Killed] ConditionalExpression
qwirkle/src/app/app.component.ts:374:54
       this.serviceQwirkle.getWinners(this.gameId).then(res => {
           this.winner = '';
           if (res !== null){
-        this.winner = board.players.filter(player => player.id === res[0])[0].pseudo;
+        this.winner = board.players.filter(player => true)[0].pseudo;
         this.nameToTurn = '';
         }
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:379:77
         }
         });
 
-        this.serviceQwirkle.getPlayer(gameId, this.userId).then((result) => {
-         this.player = result;
-          this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
-
-
-         console.log('playerId :' + this.player.id);
-         this.getPlayerIdToPlay().then();
-         this.nameToTurn = '';
-
-
-          this.game().then();
-         this.signalRService.sendPlayerInGame(gameId, this.player.id);
-                 this.rack = toRarrange(this.player.rack.tiles);
-         this.changeDetector.detectChanges();
-       });
+        this.serviceQwirkle.getPlayer(gameId, this.userId).then((result) => {});
 
 
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:381:39
 
         this.serviceQwirkle.getPlayer(gameId, this.userId).then((result) => {
          this.player = result;
-          this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+          this.player.rack.tiles.sort(() => undefined);
 
 
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:381:49
 
         this.serviceQwirkle.getPlayer(gameId, this.userId).then((result) => {
          this.player = result;
-          this.player.rack.tiles.sort((a, b) => a.rackPosition - b.rackPosition);
+          this.player.rack.tiles.sort((a, b) => a.rackPosition + b.rackPosition);
 
 
killedBy: test autozoom game should autozoom when game
