[Survived] StringLiteral
qwirkle/src/app/app.component.ts:386:28
 
          console.log('playerId :' + this.player.id);
          this.getPlayerIdToPlay().then();
-         this.nameToTurn = '';
+         this.nameToTurn = "Stryker was here!";
 
 

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:399:55
     });
   }
 
-  async countUserChange(event: number): Promise<void> {
-    this.userId = event;
-    this.serviceQwirkle.getGamesByUserId(this.userId).then((res)=>
-      {this.games=res;
-        this.games.listGameId.sort((a, b) => a - b);
-
-      }
-    );
-
-    this.resetZoomToFit();
-  }
+  async countUserChange(event: number): Promise<void> {}
 
   getPawStyle(i: number): string {

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:402:7
   async countUserChange(event: number): Promise<void> {
     this.userId = event;
     this.serviceQwirkle.getGamesByUserId(this.userId).then((res)=>
-      {this.games=res;
-        this.games.listGameId.sort((a, b) => a - b);
-
-      }
+      {}
     );
 
killedBy: test autozoom game should autozoom when game

[Killed] ArrowFunction
qwirkle/src/app/app.component.ts:403:36
     this.userId = event;
     this.serviceQwirkle.getGamesByUserId(this.userId).then((res)=>
       {this.games=res;
-        this.games.listGameId.sort((a, b) => a - b);
+        this.games.listGameId.sort(() => undefined);
 
       }
killedBy: test autozoom game should autozoom when game

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:403:46
     this.userId = event;
     this.serviceQwirkle.getGamesByUserId(this.userId).then((res)=>
       {this.games=res;
-        this.games.listGameId.sort((a, b) => a - b);
+        this.games.listGameId.sort((a, b) => a + b);
 
       }
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:411:34
     this.resetZoomToFit();
   }
 
-  getPawStyle(i: number): string {
-    return 'translate(' + -i * 65 + 'px,' + i * 15 + 'px)';
-  }
+  getPawStyle(i: number): string {}
 
 
killedBy: AppComponent should give the style of line style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-65px,15px)"
Received: undefined

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:412:27
   }
 
   getPawStyle(i: number): string {
-    return 'translate(' + -i * 65 + 'px,' + i * 15 + 'px)';
+    return 'translate(' + -i / 65 + 'px,' + i * 15 + 'px)';
   }
 
killedBy: AppComponent should give the style of line style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-65px,15px)"
Received: "translate(-0.015384615384615385px,15px)"

[Killed] UnaryOperator
qwirkle/src/app/app.component.ts:412:27
   }
 
   getPawStyle(i: number): string {
-    return 'translate(' + -i * 65 + 'px,' + i * 15 + 'px)';
+    return 'translate(' + +i * 65 + 'px,' + i * 15 + 'px)';
   }
 
killedBy: AppComponent should give the style of line style
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "translate(-65px,15px)"
Received: "translate(65px,15px)"

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:416:19
   }
 
 
-  NewGame(): void {
-    this.serviceQwirkle.newGame([10, 11]).then();
-  }
+  NewGame(): void {}
 
   async getPlayerIdToPlay(): Promise<void> {
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:420:44
     this.serviceQwirkle.newGame([10, 11]).then();
   }
 
-  async getPlayerIdToPlay(): Promise<void> {
-    this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe((res) => {
-      this.playerNameToPlay = res;
-
-    });
-  }
+  async getPlayerIdToPlay(): Promise<void> {}
 
   ngOnDestroy(): void {
killedBy: test autozoom game should autozoom when game

[Survived] BlockStatement
qwirkle/src/app/app.component.ts:421:77
   }
 
   async getPlayerIdToPlay(): Promise<void> {
-    this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe((res) => {
-      this.playerNameToPlay = res;
-
-    });
+    this.serviceQwirkle.getPlayerNameToPlay(this.gameId).subscribe((res) => {});
   }
 

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:427:23
     });
   }
 
-  ngOnDestroy(): void {
-    this.modelChangedSubscription.unsubscribe();
-    this.apiSubscription.unsubscribe();
-  }
+  ngOnDestroy(): void {}
 
   getCssScale(zoomLevel: any): number {
killedBy: test autozoom game should autozoom when game

[Killed] BlockStatement
qwirkle/src/app/app.component.ts:432:39
     this.apiSubscription.unsubscribe();
   }
 
-  getCssScale(zoomLevel: any): number {
-    return Math.pow(this.panzoomConfig.scalePerZoomLevel, zoomLevel - this.panzoomConfig.neutralZoomLevel);
-  }
+  getCssScale(zoomLevel: any): number {}
 
 
killedBy: AppComponent should change model zoom 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.25
Received: undefined

[Killed] ArithmeticOperator
qwirkle/src/app/app.component.ts:433:59
   }
 
   getCssScale(zoomLevel: any): number {
-    return Math.pow(this.panzoomConfig.scalePerZoomLevel, zoomLevel - this.panzoomConfig.neutralZoomLevel);
+    return Math.pow(this.panzoomConfig.scalePerZoomLevel, zoomLevel + this.panzoomConfig.neutralZoomLevel);
   }
 
killedBy: AppComponent should change model zoom 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0.25
Received: 4
