[Killed] BlockStatement
src/app/choose-game/choose-game.component.ts:22:51
   }
 
 
-  async gameChoice(gameId: number): Promise<void> {
-    console.log('game selected : ' + gameId + ' user : ' + this.userId);
-    this.gameSelectChange.emit(gameId);
-  }
+  async gameChoice(gameId: number): Promise<void> {}
 
 }
killedBy: ChooseGameComponent should emit on click  for game choice
statusReason: Error: Uncaught (in promise): Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/app/choose-game/choose-game.component.ts:23:47
 
 
   async gameChoice(gameId: number): Promise<void> {
-    console.log('game selected : ' + gameId + ' user : ' + this.userId);
+    console.log('game selected : ' + gameId + "" + this.userId);
     this.gameSelectChange.emit(gameId);
   }
killedBy: ChooseGameComponent should emit on click  for game choice
statusReason: Error: Uncaught (in promise): Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "game selected : 1 user : 0"
Received: "game selected : 10"

Number of calls: 1
Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)
