[Killed] StringLiteral
src/app/choose-player/choose-player.component.ts:16:16
   @Input() score: number = 0;
   @Output() playerSelectChange = new EventEmitter<Player>();
   @Input() players: Player[] = [];
-  nameToPlay = '';
+  nameToPlay = "Stryker was here!";
 
 
killedBy: ChoosePlayerComponent should create
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/app/choose-player/choose-player.component.ts:24:43
   }
 
 
-  playerToTurnClass(name: string): string {
-    return name === this.nameToTurn ? 'card-group colorTurnOn' : 'card-group colorTurnOff';
-  }
+  playerToTurnClass(name: string): string {}
 
 
killedBy: ChoosePlayerComponent should return style if name is name turn 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "card-group colorTurnOn"
Received: undefined

[Killed] ConditionalExpression
src/app/choose-player/choose-player.component.ts:25:12
 
 
   playerToTurnClass(name: string): string {
-    return name === this.nameToTurn ? 'card-group colorTurnOn' : 'card-group colorTurnOff';
+    return false ? 'card-group colorTurnOn' : 'card-group colorTurnOff';
   }
 
killedBy: ChoosePlayerComponent should return style if name is name turn 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "card-group colorTurnOn"
Received: "card-group colorTurnOff"

[Killed] EqualityOperator
src/app/choose-player/choose-player.component.ts:25:12
 
 
   playerToTurnClass(name: string): string {
-    return name === this.nameToTurn ? 'card-group colorTurnOn' : 'card-group colorTurnOff';
+    return name !== this.nameToTurn ? 'card-group colorTurnOn' : 'card-group colorTurnOff';
   }
 
killedBy: ChoosePlayerComponent should return style if name is name turn 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "card-group colorTurnOn"
Received: "card-group colorTurnOff"

[Killed] BlockStatement
src/app/choose-player/choose-player.component.ts:29:25
   }
 
 
-  isNameTurn(): boolean {
-    return this.nameToTurn !== '';
-  }
+  isNameTurn(): boolean {}
 }
 
killedBy: ChoosePlayerComponent should true if name turn 
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
src/app/choose-player/choose-player.component.ts:30:12
 
 
   isNameTurn(): boolean {
-    return this.nameToTurn !== '';
+    return this.nameToTurn === '';
   }
 }
killedBy: ChoosePlayerComponent should true if name turn 
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/app/choose-player/choose-player.component.ts:30:12
 
 
   isNameTurn(): boolean {
-    return this.nameToTurn !== '';
+    return true;
   }
 }
killedBy: ChoosePlayerComponent should false if name no turn 
statusReason: Error: expect(received).toBeFalsy()

Received: true
