[Killed] BlockStatement
src/app/new-game/new-game.component.ts:20:35
 
   }
 
-  async ngOnInit(): Promise<void> {
-    this.games = await this.service.getListGames();
-  }
+  async ngOnInit(): Promise<void> {}
 
   newGame(): void {
killedBy: NewGameComponent should init games when ngOnInit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/app/new-game/new-game.component.ts:24:19
     this.games = await this.service.getListGames();
   }
 
-  newGame(): void {
-    this.gameChange.emit(this.game);
-  }
+  newGame(): void {}
 }
 
killedBy: NewGameComponent should emit on click  game
statusReason: Error: Uncaught (in promise): Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
