[Killed] ArrayDeclaration
src/app/new-user/new-user.component.ts:13:38
 export class NewUserComponent implements OnInit {
   @Input() userId: number=0;
   @Output() userChange = new EventEmitter<number>();
-  users: ListUsersId = {listUsersId: []};
+  users: ListUsersId = {listUsersId: ["Stryker was here"]};
   constructor(public service: HttpTileRepositoryService) {
   }
killedBy: NewUserComponent should create
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "listUsersId": Array [],
+   "listUsersId": Array [

[Killed] BlockStatement
src/app/new-user/new-user.component.ts:17:35
   constructor(public service: HttpTileRepositoryService) {
   }
 
-  async ngOnInit(): Promise<void> {
-    this.users = await this.service.getUsers();
-    console.log(this.userId);
-  }
+  async ngOnInit(): Promise<void> {}
 
 
killedBy: NewUserComponent should init users when ngOnInit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/app/new-user/new-user.component.ts:23:34
   }
 
 
-  userChoice(user: number): void {
-    this.userChange.emit(user);
-  }
+  userChoice(user: number): void {}
 
 }
killedBy: NewUserComponent should emit on click  user
statusReason: Error: Uncaught (in promise): Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10

Number of calls: 0
Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10
