[Killed] ArrayDeclaration
src/app/pick/pick.component.ts:12:28
 })
 export class PickComponent {
   @Input() plate: Tile[][] = [];
-  @Input() board: Tile[] = [];
+  @Input() board: Tile[] = ["Stryker was here"];
   voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
 
killedBy: PickComponent should init plate to empty at first
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BooleanLiteral
src/app/pick/pick.component.ts:13:34
 export class PickComponent {
   @Input() plate: Tile[][] = [];
   @Input() board: Tile[] = [];
-  voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
+  voidTile: Tile[] = [{disabled: true, id: 0, shape: 0, color: 0, y: 0, x: 0}];
 
   @Input() bag: Tile[] = [];
killedBy: PickComponent should init plate to empty at first
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] ObjectLiteral
src/app/pick/pick.component.ts:13:23
 export class PickComponent {
   @Input() plate: Tile[][] = [];
   @Input() board: Tile[] = [];
-  voidTile: Tile[] = [{disabled: false, id: 0, shape: 0, color: 0, y: 0, x: 0}];
+  voidTile: Tile[] = [{}];
 
   @Input() bag: Tile[] = [];
killedBy: PickComponent should init plate to empty at first
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

  Array [
-   Object {
-     "color": 0,

[Survived] BlockStatement
src/app/pick/pick.component.ts:26:47
     return '../../assets/img/' + toNameImage(tile);
   }
 
-  dropempty(event: CdkDragDrop<Tile[]>): void {
-
-    if (event.previousContainer === event.container) {
-      moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
-    } else {
-      transferArrayItem(event.previousContainer.data,
-        event.container.data,
-        event.previousIndex,
-        event.currentIndex);
-    }
-
-
-  }
+  dropempty(event: CdkDragDrop<Tile[]>): void {}
 
   dropResult(event: CdkDragDrop<Tile[]>): void {

[Survived] ConditionalExpression
src/app/pick/pick.component.ts:28:9
 
   dropempty(event: CdkDragDrop<Tile[]>): void {
 
-    if (event.previousContainer === event.container) {
+    if (true) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
     } else {

[Survived] EqualityOperator
src/app/pick/pick.component.ts:28:9
 
   dropempty(event: CdkDragDrop<Tile[]>): void {
 
-    if (event.previousContainer === event.container) {
+    if (event.previousContainer !== event.container) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
     } else {

[Survived] BlockStatement
src/app/pick/pick.component.ts:30:12
 
     if (event.previousContainer === event.container) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
-    } else {
-      transferArrayItem(event.previousContainer.data,
-        event.container.data,
-        event.previousIndex,
-        event.currentIndex);
-    }
+    } else {}
 
 

[Survived] BlockStatement
src/app/pick/pick.component.ts:40:48
 
   }
 
-  dropResult(event: CdkDragDrop<Tile[]>): void {
-    if (event.previousContainer === event.container) {
-      moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
-    } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-      transferArrayItem(event.previousContainer.data,
-        event.container.data,
-        event.previousIndex,
-        event.currentIndex);
-      this.plate = toPlate(this.board);
-
-    }
-
-  }
+  dropResult(event: CdkDragDrop<Tile[]>): void {}
 }
 

[Survived] BlockStatement
src/app/pick/pick.component.ts:41:54
   }
 
   dropResult(event: CdkDragDrop<Tile[]>): void {
-    if (event.previousContainer === event.container) {
-      moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
-    } else {
+    if (event.previousContainer === event.container) {} else {
       this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
       transferArrayItem(event.previousContainer.data,

[Survived] BlockStatement
src/app/pick/pick.component.ts:43:12
   dropResult(event: CdkDragDrop<Tile[]>): void {
     if (event.previousContainer === event.container) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
-    } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
-      transferArrayItem(event.previousContainer.data,
-        event.container.data,
-        event.previousIndex,
-        event.currentIndex);
-      this.plate = toPlate(this.board);
-
-    }
+    } else {}
 
   }

[Survived] ConditionalExpression
src/app/pick/pick.component.ts:44:46
     if (event.previousContainer === event.container) {
       moveItemInArray(event.container.data, event.previousIndex, event.currentIndex);
     } else {
-      this.board = this.board.filter(tile => tile !== event.previousContainer.data[event.previousIndex]);
+      this.board = this.board.filter(tile => false);
       transferArrayItem(event.previousContainer.data,
         event.container.data,
