[Killed] ArrowFunction
qwirkle/src/domain/PositionIsFree.ts:6:3
 import {Tile} from './Tile';
 
 export const positionIsNotFree =
-  (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
+  () => undefined;
 export const positionIsFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Killed] LogicalOperator
qwirkle/src/domain/PositionIsFree.ts:7:26
 
 export const positionIsNotFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
+    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y && tile.id === newTile.id).length !== 0;
 export const positionIsFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Killed] ArrowFunction
qwirkle/src/domain/PositionIsFree.ts:7:18
 
 export const positionIsNotFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
+    tiles.filter(() => undefined).length !== 0;
 export const positionIsFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Killed] ArrowFunction
qwirkle/src/domain/PositionIsFree.ts:9:3
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
     tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
 export const positionIsFree =
-  (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length === 0;
+  () => undefined;
 
killedBy: test position is free should test position is free for positionisfree
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
qwirkle/src/domain/PositionIsFree.ts:10:50
     tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
 export const positionIsFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length === 0;
+    tiles.filter(tile => tile.x === newTile.x && false || tile.id === newTile.id).length === 0;
 
killedBy: create tiles list should add tile in row at position x=1 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

@@ -5,6 +5,14 @@
      "id": 1,
      "shape": 1,

[Killed] LogicalOperator
qwirkle/src/domain/PositionIsFree.ts:10:26
     tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length !== 0;
 export const positionIsFree =
   (tiles: Tile[], newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }): boolean =>
-    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y || tile.id === newTile.id).length === 0;
+    tiles.filter(tile => tile.x === newTile.x && tile.y === newTile.y && tile.id === newTile.id).length === 0;
 
killedBy: create tiles list should add tile in row at position x=1 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

@@ -5,6 +5,14 @@
      "id": 1,
      "shape": 1,
