[Killed] BlockStatement
qwirkle/src/domain/SetPositionTile.ts:7:71
 import {Shape} from './Shape';
 import {Color} from './Color';
 
-export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {
-    const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
-    if (positionIsFree(tiles, newTile)) {
-        return [...tiles, newTile].sort((firstTile, secondTile) =>
-            (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
-
-    }
-
-    return [...tiles];
-};
+export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {};
 export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {
   return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
killedBy: create tiles list should add tile in row at position x=0 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"color": 3, "disabled": true, "id": 1, "shape": 1, "x": 0, "y": 0}]
Received: undefined

[Killed] BlockStatement
qwirkle/src/domain/SetPositionTile.ts:9:41
 
 export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
-    if (positionIsFree(tiles, newTile)) {
-        return [...tiles, newTile].sort((firstTile, secondTile) =>
-            (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
-
-    }
+    if (positionIsFree(tiles, newTile)) {}
 
     return [...tiles];
killedBy: create tiles list should add tile in row at position x=0 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "color": 3,

[Killed] ConditionalExpression
qwirkle/src/domain/SetPositionTile.ts:9:9
 
 export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
-    if (positionIsFree(tiles, newTile)) {
+    if (true) {
         return [...tiles, newTile].sort((firstTile, secondTile) =>
             (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
killedBy: create tiles list should add tile in row at position x=1 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

@@ -5,6 +5,14 @@
      "id": 1,
      "shape": 1,

[Killed] ArrowFunction
qwirkle/src/domain/SetPositionTile.ts:10:41
 export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
     if (positionIsFree(tiles, newTile)) {
-        return [...tiles, newTile].sort((firstTile, secondTile) =>
-            (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
+        return [...tiles, newTile].sort(() => undefined);
 
     }
killedBy: create tiles list should add tile in row at position x=-1 and y=0 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 4,

[Killed] ArrayDeclaration
qwirkle/src/domain/SetPositionTile.ts:10:16
 export const setPositionTile = (tiles: Tile[], tile: Tile): Tile[] => {
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
     if (positionIsFree(tiles, newTile)) {
-        return [...tiles, newTile].sort((firstTile, secondTile) =>
+        return [].sort((firstTile, secondTile) =>
             (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
 
killedBy: create tiles list should add tile in row at position x=0 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "color": 3,

[Killed] LogicalOperator
qwirkle/src/domain/SetPositionTile.ts:11:13
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
     if (positionIsFree(tiles, newTile)) {
         return [...tiles, newTile].sort((firstTile, secondTile) =>
-            (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
+            firstTile.y - secondTile.y && firstTile.x - secondTile.x);
 
     }
killedBy: create tiles list should add tile in row at position x=-1 and y=0 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 4,

[Killed] ConditionalExpression
qwirkle/src/domain/SetPositionTile.ts:11:13
     const newTile = {id: tile.id, shape: tile.shape, color: tile.color, x: tile.x, y: tile.y, disabled: tile.disabled};
     if (positionIsFree(tiles, newTile)) {
         return [...tiles, newTile].sort((firstTile, secondTile) =>
-            (firstTile.y - secondTile.y) || (firstTile.x - secondTile.x));
+            false);
 
     }
killedBy: create tiles list should add tile in row at position x=-1 and y=0 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 4,

[Killed] ArrayDeclaration
qwirkle/src/domain/SetPositionTile.ts:15:12
 
     }
 
-    return [...tiles];
+    return [];
 };
 export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {
killedBy: create tiles list should add tile in row at position x=1 and y=0
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "color": 3,

[Killed] BlockStatement
qwirkle/src/domain/SetPositionTile.ts:17:81
 
     return [...tiles];
 };
-export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {
-  return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
+export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {});
 
 
killedBy: AppComponent should rearrange rack 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 48
+ Received  +  6

  Array [
-   Object {
-     "color": 2,

[Killed] ArrowFunction
qwirkle/src/domain/SetPositionTile.ts:17:27
 
     return [...tiles];
 };
-export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {
-  return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
+export const toRarrange = () => undefined;
 
 
killedBy: AppComponent should rearrange rack 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BooleanLiteral
qwirkle/src/domain/SetPositionTile.ts:18:21
     return [...tiles];
 };
 export const toRarrange = (rack: Tiles[]): Tile[] =>  rack.map((tile, index) => {
-  return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
+  return {disabled: false, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
 
 
killedBy: AppComponent should rearrange rack 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -1,49 +1,49 @@
  Array [
    Object {

[Killed] BlockStatement
qwirkle/src/domain/SetPositionTile.ts:21:77
   return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
 
 
-export const toTiles = (rack: Tile[]): Tiles[] => rack.map((tile, index) => {
-  return {color: tile.color, shape : tile.shape, id : tile.id, rackPosition: index}; });
+export const toTiles = (rack: Tile[]): Tiles[] => rack.map((tile, index) => {});
 
killedBy: test toFile should return rack tiles to Tile
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "color": 3,

[Killed] ArrowFunction
qwirkle/src/domain/SetPositionTile.ts:21:24
   return {disabled: true, x: index, y: 0, color: tile.color, shape : tile.shape, id : tile.id}; });
 
 
-export const toTiles = (rack: Tile[]): Tiles[] => rack.map((tile, index) => {
-  return {color: tile.color, shape : tile.shape, id : tile.id, rackPosition: index}; });
+export const toTiles = () => undefined;
 
killedBy: test toFile should return rack tiles to Tile
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"color": 3, "id": 2, "rackPosition": 0, "shape": 2}]
Received: undefined
