[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:17:45
 };
 
 
-export const toNameImage = (tile: Tile) => (tile.shape === 0) ? '' : Object.keys(Color)[Object.values(Color).indexOf(tile.color)] +
+export const toNameImage = (tile: Tile) => (tile.shape !== 0) ? '' : Object.keys(Color)[Object.values(Color).indexOf(tile.color)] +
   Object.keys(Shape)[Object.values(Shape).indexOf(tile.shape)] + '.svg';
 
killedBy: create tiles list should get image name from Tile
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "PurpleCircle.svg"
Received: ""

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:17:45
 };
 
 
-export const toNameImage = (tile: Tile) => (tile.shape === 0) ? '' : Object.keys(Color)[Object.values(Color).indexOf(tile.color)] +
+export const toNameImage = (tile: Tile) => (true) ? '' : Object.keys(Color)[Object.values(Color).indexOf(tile.color)] +
   Object.keys(Shape)[Object.values(Shape).indexOf(tile.shape)] + '.svg';
 
killedBy: create tiles list should get image name from Tile
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "PurpleCircle.svg"
Received: ""

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:33:22
 };
 
 
-const shiftToRight = (tile: Tile): Tile => ({
-  id: tile.id, shape: tile.shape,
-  color: tile.color, x: tile.x - 1,
-  y: tile.y, disabled: true
-});
+const shiftToRight = () => undefined;
 
 export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] ObjectLiteral
qwirkle/src/domain/Tile.ts:33:45
 };
 
 
-const shiftToRight = (tile: Tile): Tile => ({
-  id: tile.id, shape: tile.shape,
-  color: tile.color, x: tile.x - 1,
-  y: tile.y, disabled: true
-});
+const shiftToRight = (tile: Tile): Tile => ({});
 
 export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  8

  Array [
    Object {
-     "color": 4,

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:35:25
 
 const shiftToRight = (tile: Tile): Tile => ({
   id: tile.id, shape: tile.shape,
-  color: tile.color, x: tile.x - 1,
+  color: tile.color, x: tile.x + 1,
   y: tile.y, disabled: true
 });
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

@@ -2,25 +2,25 @@
    Object {
      "color": 4,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:36:24
 const shiftToRight = (tile: Tile): Tile => ({
   id: tile.id, shape: tile.shape,
   color: tile.color, x: tile.x - 1,
-  y: tile.y, disabled: true
+  y: tile.y, disabled: false
 });
 
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,17 +1,17 @@
  Array [
    Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:39:24
   y: tile.y, disabled: true
 });
 
-export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
-  tile.x >= xposition && tile.y === newTile.y;
+export const onRight = () => undefined;
 
 const shiftToLeft = (tile: Tile): Tile => ({
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:40:3
 });
 
 export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
-  tile.x >= xposition && tile.y === newTile.y;
+  tile.x < xposition && tile.y === newTile.y;
 
 const shiftToLeft = (tile: Tile): Tile => ({
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:40:3
 });
 
 export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
-  tile.x >= xposition && tile.y === newTile.y;
+  true;
 
 const shiftToLeft = (tile: Tile): Tile => ({
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -2,18 +2,10 @@
    Object {
      "color": 4,

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:42:21
 export const onRight = (tile: Tile, xposition: number, newTile: Tile): boolean =>
   tile.x >= xposition && tile.y === newTile.y;
 
-const shiftToLeft = (tile: Tile): Tile => ({
-  id: tile.id, shape: tile.shape,
-  color: tile.color, x: tile.x + 1,
-  y: tile.y, disabled: true
-});
+const shiftToLeft = () => undefined;
 
 export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y === tile.y;
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:44:25
 
 const shiftToLeft = (tile: Tile): Tile => ({
   id: tile.id, shape: tile.shape,
-  color: tile.color, x: tile.x + 1,
+  color: tile.color, x: tile.x - 1,
   y: tile.y, disabled: true
 });
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

@@ -6,21 +6,21 @@
      "shape": 1,
      "x": -1,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:45:24
 const shiftToLeft = (tile: Tile): Tile => ({
   id: tile.id, shape: tile.shape,
   color: tile.color, x: tile.x + 1,
-  y: tile.y, disabled: true
+  y: tile.y, disabled: false
 });
 
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -15,11 +15,11 @@
      "x": 0,
      "y": 0,

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:48:98
   y: tile.y, disabled: true
 });
 
-export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y === tile.y;
+export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y !== tile.y;
 
 const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -2,17 +2,9 @@
    Object {
      "color": 3,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:48:69
   y: tile.y, disabled: true
 });
 
-export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y === tile.y;
+export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => true;
 
 const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: TypeError: Cannot read property 'disabled' of undefined

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:50:22
 
 export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y === tile.y;
 
-const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
+const tileNotInRow = () => undefined;
 export
 const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: TypeError: undefined is not a function

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:50:44
 
 export const otherTileInRow = (tileInsert: Tile) => (tile: Tile) => tile.id !== tileInsert.id && tileInsert.y === tile.y;
 
-const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
+const tileNotInRow = (tileInsert: Tile) => () => undefined;
 export
 const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  0

@@ -1,24 +1,8 @@
  Array [
    Object {

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:52:56
 
 const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
 export
-const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
+const onLeft = (xposition: number) => (tile: Tile)  => tile.x >= xposition ;
 
 function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -2,17 +2,17 @@
    Object {
      "color": 3,

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:52:16
 
 const tileNotInRow = (tileInsert: Tile) => (tile: Tile)  => tileInsert.y !== tile.y;
 export
-const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
+const onLeft = () => undefined ;
 
 function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: TypeError: undefined is not a function

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:54:156
 export
 const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
 
-function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
-  return rowTile.map(tile => {
-    if (onRight(tile, xposition, newTile)) {
-      return shiftToLeft(tile);
-    }
-    return tile;
-  });
-}
+function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {}
 
 function placeTileToRigth(rowTile: Tile[], xposition: number) {
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:55:30
 const onLeft = (xposition: number) => (tile: Tile)  => tile.x < xposition ;
 
 function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
-  return rowTile.map(tile => {
-    if (onRight(tile, xposition, newTile)) {
-      return shiftToLeft(tile);
-    }
-    return tile;
-  });
+  return rowTile.map(tile => {});
 }
 
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:56:9
 
 function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
   return rowTile.map(tile => {
-    if (onRight(tile, xposition, newTile)) {
+    if (false) {
       return shiftToLeft(tile);
     }
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

@@ -6,21 +6,13 @@
      "shape": 1,
      "x": -1,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:56:9
 
 function placeTileToLeft(rowTile: Tile[], xposition: number, newTile: { shape: Shape; color: Color; x: number; y: number; disabled: boolean; id: number }) {
   return rowTile.map(tile => {
-    if (onRight(tile, xposition, newTile)) {
+    if (true) {
       return shiftToLeft(tile);
     }
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -2,18 +2,10 @@
    Object {
      "color": 4,

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:63:63
   });
 }
 
-function placeTileToRigth(rowTile: Tile[], xposition: number) {
-  return rowTile.map(tile => {
-    if (onLeft(xposition) && tile.disabled) {
-      return shiftToRight(tile);
-    }
-    return tile;
-  });
-}
+function placeTileToRigth(rowTile: Tile[], xposition: number) {}
 
 export const insertPosition = (nexTiles: Tile[], tileInsert: Tile, xposition: number): Tile[] => {
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:64:30
 }
 
 function placeTileToRigth(rowTile: Tile[], xposition: number) {
-  return rowTile.map(tile => {
-    if (onLeft(xposition) && tile.disabled) {
-      return shiftToRight(tile);
-    }
-    return tile;
-  });
+  return rowTile.map(tile => {});
 }
 
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:65:45
 
 function placeTileToRigth(rowTile: Tile[], xposition: number) {
   return rowTile.map(tile => {
-    if (onLeft(xposition) && tile.disabled) {
-      return shiftToRight(tile);
-    }
+    if (onLeft(xposition) && tile.disabled) {}
     return tile;
   });
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -2,18 +2,10 @@
    Object {
      "color": 4,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:65:9
 
 function placeTileToRigth(rowTile: Tile[], xposition: number) {
   return rowTile.map(tile => {
-    if (onLeft(xposition) && tile.disabled) {
+    if (true) {
       return shiftToRight(tile);
     }
killedBy: create tiles list should insert a tile in board before tile disabled  
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

@@ -6,21 +6,13 @@
      "shape": 1,
      "x": -2,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:73:7
 }
 
 export const insertPosition = (nexTiles: Tile[], tileInsert: Tile, xposition: number): Tile[] => {
-  if (tileInsert.disabled) {
+  if (true) {
   let rowTile = nexTiles.filter(otherTileInRow(tileInsert));
 
killedBy: create tiles list should not insert a tile between  two tile in row if disabled to false
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 9

@@ -6,13 +6,21 @@
      "shape": 1,
      "x": -1,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:73:7
 }
 
 export const insertPosition = (nexTiles: Tile[], tileInsert: Tile, xposition: number): Tile[] => {
-  if (tileInsert.disabled) {
+  if (false) {
   let rowTile = nexTiles.filter(otherTileInRow(tileInsert));
 
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:79:32
   const rowTilenotInsert = nexTiles.filter(tileNotInRow(tileInsert));
   let newTile:Tile = {
     id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
-    y: tileInsert.y, disabled: true
+    y: tileInsert.y, disabled: false
   };
   if (positionIsNotFree(rowTile, newTile)) {
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
      "x": -1,
      "y": 0,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:81:7
     id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
     y: tileInsert.y, disabled: true
   };
-  if (positionIsNotFree(rowTile, newTile)) {
+  if (false) {
     const before = rowTile.filter(onLeft(xposition));
     const after = rowTile.filter(tile => onRight(tile, xposition, newTile));
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Timeout] ConditionalExpression
qwirkle/src/domain/Tile.ts:81:7
     id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
     y: tileInsert.y, disabled: true
   };
-  if (positionIsNotFree(rowTile, newTile)) {
+  if (true) {
     const before = rowTile.filter(onLeft(xposition));
     const after = rowTile.filter(tile => onRight(tile, xposition, newTile));

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:83:34
   };
   if (positionIsNotFree(rowTile, newTile)) {
     const before = rowTile.filter(onLeft(xposition));
-    const after = rowTile.filter(tile => onRight(tile, xposition, newTile));
+    const after = rowTile.filter(() => undefined);
 
     if (before.length > 0 && after[0].disabled) {
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:85:9
     const before = rowTile.filter(onLeft(xposition));
     const after = rowTile.filter(tile => onRight(tile, xposition, newTile));
 
-    if (before.length > 0 && after[0].disabled) {
+    if (false) {
       rowTile = placeTileToLeft(rowTile, xposition, newTile);
 
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

@@ -2,25 +2,17 @@
    Object {
      "color": 4,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:85:9
     const before = rowTile.filter(onLeft(xposition));
     const after = rowTile.filter(tile => onRight(tile, xposition, newTile));
 
-    if (before.length > 0 && after[0].disabled) {
+    if (false && after[0].disabled) {
       rowTile = placeTileToLeft(rowTile, xposition, newTile);
 
killedBy: create tiles list should insert a tile between  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

@@ -2,25 +2,17 @@
    Object {
      "color": 4,

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:89:50
       rowTile = placeTileToLeft(rowTile, xposition, newTile);
 
 
-    } else if (before[0] !== undefined && before[before.length - 1].disabled) {
+    } else if (before[0] !== undefined && before[before.length + 1].disabled) {
       rowTile = placeTileToRigth(rowTile, xposition);
       newTile = shiftToRight(newTile);
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: TypeError: Cannot read property 'disabled' of undefined

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:89:16
       rowTile = placeTileToLeft(rowTile, xposition, newTile);
 
 
-    } else if (before[0] !== undefined && before[before.length - 1].disabled) {
+    } else if (before[0] === undefined && before[before.length - 1].disabled) {
       rowTile = placeTileToRigth(rowTile, xposition);
       newTile = shiftToRight(newTile);
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: TypeError: Cannot read property 'disabled' of undefined

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:93:12
       rowTile = placeTileToRigth(rowTile, xposition);
       newTile = shiftToRight(newTile);
 
-    } else {
-      if (before.length >= after.length) {
-        const xmax = Math.max(...rowTile.map(max => max.x));
-        newTile = {
-          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax + 1,
-          y: tileInsert.y, disabled: true
-        };
-      } else {
-        const xmin = Math.min(...rowTile.map(min => min.x));
-
-        newTile = {
-          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmin - 1,
-          y: tileInsert.y, disabled: true
-        };
-      }
-    }
+    } else {}
   }
 
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:94:11
       newTile = shiftToRight(newTile);
 
     } else {
-      if (before.length >= after.length) {
+      if (before.length < after.length) {
         const xmax = Math.max(...rowTile.map(max => max.x));
         newTile = {
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] EqualityOperator
qwirkle/src/domain/Tile.ts:94:11
       newTile = shiftToRight(newTile);
 
     } else {
-      if (before.length >= after.length) {
+      if (before.length > after.length) {
         const xmax = Math.max(...rowTile.map(max => max.x));
         newTile = {
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

@@ -1,8 +1,16 @@
  Array [
    Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:95:46
 
     } else {
       if (before.length >= after.length) {
-        const xmax = Math.max(...rowTile.map(max => max.x));
+        const xmax = Math.max(...rowTile.map(() => undefined));
         newTile = {
           id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax + 1,
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -18,9 +18,9 @@
    Object {
      "color": 4,

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:97:83
       if (before.length >= after.length) {
         const xmax = Math.max(...rowTile.map(max => max.x));
         newTile = {
-          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax + 1,
+          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax - 1,
           y: tileInsert.y, disabled: true
         };
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -13,14 +13,6 @@
      "id": 1,
      "shape": 1,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:98:38
         const xmax = Math.max(...rowTile.map(max => max.x));
         newTile = {
           id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax + 1,
-          y: tileInsert.y, disabled: true
+          y: tileInsert.y, disabled: false
         };
       } else {
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -15,11 +15,11 @@
      "x": 0,
      "y": 0,

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:100:14
           id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmax + 1,
           y: tileInsert.y, disabled: true
         };
-      } else {
-        const xmin = Math.min(...rowTile.map(min => min.x));
-
-        newTile = {
-          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmin - 1,
-          y: tileInsert.y, disabled: true
-        };
-      }
+      } else {}
     }
   }
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -1,15 +1,7 @@
  Array [
    Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:101:46
           y: tileInsert.y, disabled: true
         };
       } else {
-        const xmin = Math.min(...rowTile.map(min => min.x));
+        const xmin = Math.min(...rowTile.map(() => undefined));
 
         newTile = {
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:104:83
         const xmin = Math.min(...rowTile.map(min => min.x));
 
         newTile = {
-          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmin - 1,
+          id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmin + 1,
           y: tileInsert.y, disabled: true
         };
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:105:38
 
         newTile = {
           id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xmin - 1,
-          y: tileInsert.y, disabled: true
+          y: tileInsert.y, disabled: false
         };
       }
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:111:75
     }
   }
 
-  return setPositionTile([...rowTilenotInsert, ...rowTile].filter(tile => tile.id !== newTile.id), newTile);
+  return setPositionTile([...rowTilenotInsert, ...rowTile].filter(tile => true), newTile);
   }
   return nexTiles;
killedBy: create tiles list should insert a tile on two tile in row  and after to up the row
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -18,9 +18,9 @@
    Object {
      "color": 4,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:111:75
     }
   }
 
-  return setPositionTile([...rowTilenotInsert, ...rowTile].filter(tile => tile.id !== newTile.id), newTile);
+  return setPositionTile([...rowTilenotInsert, ...rowTile].filter(tile => false), newTile);
   }
   return nexTiles;
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -5,14 +5,6 @@
      "id": 1,
      "shape": 1,

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:115:117
   }
   return nexTiles;
 };
-export const changePosition = (rowTile: Tile[], tileInsert: Tiles, xposition: number, yposition: number): Tile[] => {
-
-  const insertTile: Tile = {
-    id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
-    y: yposition, disabled: true
-  };
- return insertPosition(rowTile, insertTile, xposition);
-};
+export const changePosition = (rowTile: Tile[], tileInsert: Tiles, xposition: number, yposition: number): Tile[] => {};
 
 
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"color": 3, "disabled": true, "id": 1, "shape": 1, "x": -2, "y": 0}, {"color": 4, "disabled": true, "id": 2, "shape": 1, "x": -1, "y": 0}]
Received: undefined

[Killed] ObjectLiteral
qwirkle/src/domain/Tile.ts:117:28
 };
 export const changePosition = (rowTile: Tile[], tileInsert: Tiles, xposition: number, yposition: number): Tile[] => {
 
-  const insertTile: Tile = {
-    id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
-    y: yposition, disabled: true
-  };
+  const insertTile: Tile = {};
  return insertPosition(rowTile, insertTile, xposition);
 };
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:119:29
 
   const insertTile: Tile = {
     id: tileInsert.id, shape: tileInsert.shape, color: tileInsert.color, x: xposition,
-    y: yposition, disabled: true
+    y: yposition, disabled: false
   };
  return insertPosition(rowTile, insertTile, xposition);
killedBy: create tiles list should inverse position of  two tile in row 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "color": 3,
