[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:126:48
 
 
 export const toPlate = (rowTile: Tile[]): Tile[][] => {
-  const xmin: number = Math.min(...rowTile.map(tile => tile.x));
+  const xmin: number = Math.min(...rowTile.map(() => undefined));
   const xmax = Math.max(...rowTile.map(tile => tile.x));
   const ymin = Math.min(...rowTile.map(tile => tile.y));
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 168
+ Received  +   4

  Array [
-   Array [
-     Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:127:40
 
 export const toPlate = (rowTile: Tile[]): Tile[][] => {
   const xmin: number = Math.min(...rowTile.map(tile => tile.x));
-  const xmax = Math.max(...rowTile.map(tile => tile.x));
+  const xmax = Math.max(...rowTile.map(() => undefined));
   const ymin = Math.min(...rowTile.map(tile => tile.y));
   const ymax = Math.max(...rowTile.map(tile => tile.y));
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 168
+ Received  +   4

  Array [
-   Array [
-     Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:128:40
 export const toPlate = (rowTile: Tile[]): Tile[][] => {
   const xmin: number = Math.min(...rowTile.map(tile => tile.x));
   const xmax = Math.max(...rowTile.map(tile => tile.x));
-  const ymin = Math.min(...rowTile.map(tile => tile.y));
+  const ymin = Math.min(...rowTile.map(() => undefined));
   const ymax = Math.max(...rowTile.map(tile => tile.y));
   let coordx:number[] = [];
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 170
+ Received  +   1

- Array [
-   Array [
-     Object {

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:129:40
   const xmin: number = Math.min(...rowTile.map(tile => tile.x));
   const xmax = Math.max(...rowTile.map(tile => tile.x));
   const ymin = Math.min(...rowTile.map(tile => tile.y));
-  const ymax = Math.max(...rowTile.map(tile => tile.y));
+  const ymax = Math.max(...rowTile.map(() => undefined));
   let coordx:number[] = [];
   for (let k = xmin - 1; k <= xmax + 1; k++) {
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 170
+ Received  +   1

- Array [
-   Array [
-     Object {

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:131:31
   const ymin = Math.min(...rowTile.map(tile => tile.y));
   const ymax = Math.max(...rowTile.map(tile => tile.y));
   let coordx:number[] = [];
-  for (let k = xmin - 1; k <= xmax + 1; k++) {
+  for (let k = xmin - 1; k <= xmax - 1; k++) {
     coordx = [...coordx, k];
   }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 64
+ Received  +  0

@@ -22,26 +22,10 @@
        "id": 0,
        "shape": 0,

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:131:16
   const ymin = Math.min(...rowTile.map(tile => tile.y));
   const ymax = Math.max(...rowTile.map(tile => tile.y));
   let coordx:number[] = [];
-  for (let k = xmin - 1; k <= xmax + 1; k++) {
+  for (let k = xmin + 1; k <= xmax + 1; k++) {
     coordx = [...coordx, k];
   }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 64
+ Received  +  0

@@ -3,26 +3,10 @@
      Object {
        "color": 0,

[Killed] ArrayDeclaration
qwirkle/src/domain/Tile.ts:132:14
   const ymax = Math.max(...rowTile.map(tile => tile.y));
   let coordx:number[] = [];
   for (let k = xmin - 1; k <= xmax + 1; k++) {
-    coordx = [...coordx, k];
+    coordx = [];
   }
   let coordy:number[] = [];
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 168
+ Received  +   4

  Array [
-   Array [
-     Object {

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:135:46
     coordx = [...coordx, k];
   }
   let coordy:number[] = [];
-  for (let k = ymin - 1; k <= ymax + 1; k++) {
-    coordy = [...coordy, k];
-  }
+  for (let k = ymin - 1; k <= ymax + 1; k++) {}
   const result: Tile[][] = Array(coordy.length).fill(null).map((_, indexY) =>
 
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 170
+ Received  +   1

- Array [
-   Array [
-     Object {

[Killed] ArithmeticOperator
qwirkle/src/domain/Tile.ts:135:31
     coordx = [...coordx, k];
   }
   let coordy:number[] = [];
-  for (let k = ymin - 1; k <= ymax + 1; k++) {
+  for (let k = ymin - 1; k <= ymax - 1; k++) {
     coordy = [...coordy, k];
   }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 84
+ Received  +  0

@@ -81,90 +81,6 @@
        "shape": 0,
        "x": 2,

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:138:64
   for (let k = ymin - 1; k <= ymax + 1; k++) {
     coordy = [...coordy, k];
   }
-  const result: Tile[][] = Array(coordy.length).fill(null).map((_, indexY) =>
-
-    Array(coordx.length).fill(null).map((_, indexX) =>
-      ({
-        id: 0, shape: 0, color: 0, x: coordx[indexX],
-        y: coordy[indexY], disabled: false
-      })));
+  const result: Tile[][] = Array(coordy.length).fill(null).map(() => undefined);
 
   for (const tile of rowTile) {
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ArrowFunction
qwirkle/src/domain/Tile.ts:140:41
   }
   const result: Tile[][] = Array(coordy.length).fill(null).map((_, indexY) =>
 
-    Array(coordx.length).fill(null).map((_, indexX) =>
-      ({
-        id: 0, shape: 0, color: 0, x: coordx[indexX],
-        y: coordy[indexY], disabled: false
-      })));
+    Array(coordx.length).fill(null).map(() => undefined));
 
   for (const tile of rowTile) {
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: TypeError: Cannot read property 'x' of undefined

[Killed] ArrayDeclaration
qwirkle/src/domain/Tile.ts:140:5
   }
   const result: Tile[][] = Array(coordy.length).fill(null).map((_, indexY) =>
 
-    Array(coordx.length).fill(null).map((_, indexX) =>
+    Array().fill(null).map((_, indexX) =>
       ({
         id: 0, shape: 0, color: 0, x: coordx[indexX],
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 168
+ Received  +   4

  Array [
-   Array [
-     Object {

[Killed] ObjectLiteral
qwirkle/src/domain/Tile.ts:141:8
   const result: Tile[][] = Array(coordy.length).fill(null).map((_, indexY) =>
 
     Array(coordx.length).fill(null).map((_, indexX) =>
-      ({
-        id: 0, shape: 0, color: 0, x: coordx[indexX],
-        y: coordy[indexY], disabled: false
-      })));
+      ({})));
 
   for (const tile of rowTile) {
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 160
+ Received  +  20

  Array [
    Array [
-     Object {

[Killed] BooleanLiteral
qwirkle/src/domain/Tile.ts:143:38
     Array(coordx.length).fill(null).map((_, indexX) =>
       ({
         id: 0, shape: 0, color: 0, x: coordx[indexX],
-        y: coordy[indexY], disabled: false
+        y: coordy[indexY], disabled: true
       })));
 
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  + 16

@@ -1,60 +1,60 @@
  Array [
    Array [

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:146:31
         y: coordy[indexY], disabled: false
       })));
 
-  for (const tile of rowTile) {
-    let i = 0;
-    for (const tileResult of result) {
-      let j = 0;
-
-      for (const tileCurrent of tileResult) {
-
-        if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
-          result[i][j] = tile;
-        }
-        j++;
-      }
-      i++;
-    }
-  }
+  for (const tile of rowTile) {}
   return result;
 };
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:148:38
 
   for (const tile of rowTile) {
     let i = 0;
-    for (const tileResult of result) {
-      let j = 0;
-
-      for (const tileCurrent of tileResult) {
-
-        if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
-          result[i][j] = tile;
-        }
-        j++;
-      }
-      i++;
-    }
+    for (const tileResult of result) {}
   }
   return result;
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] BlockStatement
qwirkle/src/domain/Tile.ts:151:45
     for (const tileResult of result) {
       let j = 0;
 
-      for (const tileCurrent of tileResult) {
-
-        if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
-          result[i][j] = tile;
-        }
-        j++;
-      }
+      for (const tileCurrent of tileResult) {}
       i++;
     }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:153:13
 
       for (const tileCurrent of tileResult) {
 
-        if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
+        if (false && tile.y === tileCurrent.y) {
           result[i][j] = tile;
         }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] ConditionalExpression
qwirkle/src/domain/Tile.ts:153:13
 
       for (const tileCurrent of tileResult) {
 
-        if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
+        if (false) {
           result[i][j] = tile;
         }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] UpdateOperator
qwirkle/src/domain/Tile.ts:156:9
         if (tile.x === tileCurrent.x && tile.y === tileCurrent.y) {
           result[i][j] = tile;
         }
-        j++;
+        j--;
       }
       i++;
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

@@ -57,22 +57,22 @@
        "shape": 0,
        "x": -1,

[Killed] UpdateOperator
qwirkle/src/domain/Tile.ts:158:7
         }
         j++;
       }
-      i++;
+      i--;
     }
   }
killedBy: create tiles list should transshape board from API to plate for Droplist
statusReason: TypeError: Cannot set property '2' of undefined
