[Killed] BlockStatement
qwirkle/src/domain/player.ts:16:56
   rack: { tiles: Tiles[] };
   isTurn: boolean;
 }
-export const toWebPlayer = (result: Player): number => {
-  return result.id;
-};
+export const toWebPlayer = (result: Player): number => {};
 
 export const toWebTiles = (result: Player): Tile[] => {
killedBy: player should return player id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[Killed] BlockStatement
qwirkle/src/domain/player.ts:20:55
   return result.id;
 };
 
-export const toWebTiles = (result: Player): Tile[] => {
-  return result.rack.tiles.map(tile => ({
-    id: tile.id,
-    color: tile.color,
-    shape: tile.shape,
-    x: 0,
-    y: 0,
-    disabled: false
-  }));
-};
+export const toWebTiles = (result: Player): Tile[] => {};
 
 interface Coord {
killedBy: Get response from qwirkle api should create first Tile from qwirkle Game API 
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ArrowFunction
qwirkle/src/domain/player.ts:21:32
 };
 
 export const toWebTiles = (result: Player): Tile[] => {
-  return result.rack.tiles.map(tile => ({
-    id: tile.id,
-    color: tile.color,
-    shape: tile.shape,
-    x: 0,
-    y: 0,
-    disabled: false
-  }));
+  return result.rack.tiles.map(() => undefined);
 };
 
killedBy: Get response from qwirkle api should create first Tile from qwirkle Game API 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"color": 6, "disabled": false, "id": 99, "shape": 6, "x": 0, "y": 0}
Received: undefined

[Killed] BooleanLiteral
qwirkle/src/domain/player.ts:27:15
     shape: tile.shape,
     x: 0,
     y: 0,
-    disabled: false
+    disabled: true
   }));
 };
killedBy: Get response from qwirkle api should create first Tile from qwirkle Game API 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "color": 6,
-   "disabled": false,

[Killed] BlockStatement
qwirkle/src/domain/player.ts:86:58
   tileId: number;
 }
 
-export const toBoard = (result: RestBoard): BoardGame => {
-  return {boards: result.board.tiles.map(tile1 => ({
-    x: tile1.coordinates.x, y: tile1.coordinates.y,
-    id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: false
-  })), players: result.players};
-};
+export const toBoard = (result: RestBoard): BoardGame => {};
 export const toPlayers = (result: RestBoard): Player[] => {
   return result.players;
killedBy: player should return Boargame with mock restboard'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
qwirkle/src/domain/player.ts:87:42
 }
 
 export const toBoard = (result: RestBoard): BoardGame => {
-  return {boards: result.board.tiles.map(tile1 => ({
-    x: tile1.coordinates.x, y: tile1.coordinates.y,
-    id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: false
-  })), players: result.players};
+  return {boards: result.board.tiles.map(() => undefined), players: result.players};
 };
 export const toPlayers = (result: RestBoard): Player[] => {
killedBy: player should return Boargame with mock restboard'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 144
+ Received  +  18

@@ -1,151 +1,25 @@
  Object {
    "boards": Array [

[Killed] ObjectLiteral
qwirkle/src/domain/player.ts:87:52
 }
 
 export const toBoard = (result: RestBoard): BoardGame => {
-  return {boards: result.board.tiles.map(tile1 => ({
-    x: tile1.coordinates.x, y: tile1.coordinates.y,
-    id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: false
-  })), players: result.players};
+  return {boards: result.board.tiles.map(tile1 => ({})), players: result.players};
 };
 export const toPlayers = (result: RestBoard): Player[] => {
killedBy: player should return Boargame with mock restboard'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 144
+ Received  +  18

@@ -1,151 +1,25 @@
  Object {
    "boards": Array [

[Killed] BooleanLiteral
qwirkle/src/domain/player.ts:89:69
 export const toBoard = (result: RestBoard): BoardGame => {
   return {boards: result.board.tiles.map(tile1 => ({
     x: tile1.coordinates.x, y: tile1.coordinates.y,
-    id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: false
+    id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: true
   })), players: result.players};
 };
killedBy: player should return Boargame with mock restboard'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  + 18

@@ -1,146 +1,146 @@
  Object {
    "boards": Array [

[Killed] BlockStatement
qwirkle/src/domain/player.ts:92:59
     id: tile1.id, shape: tile1.shape, color: tile1.color, disabled: false
   })), players: result.players};
 };
-export const toPlayers = (result: RestBoard): Player[] => {
-  return result.players;
-};
+export const toPlayers = (result: RestBoard): Player[] => {};
 export const toChangeRack = (rack: RestRack): Rack => {
   return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
killedBy: player should return players with restboard 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
qwirkle/src/domain/player.ts:95:55
 export const toPlayers = (result: RestBoard): Player[] => {
   return result.players;
 };
-export const toChangeRack = (rack: RestRack): Rack => {
-  return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
-};
+export const toChangeRack = (rack: RestRack): Rack => {};
 export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
   return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
killedBy: player should return Rack with restRack
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"code": 0, "newRack": [], "points": 0, "tilesPlayed": []}
Received: undefined

[Killed] ObjectLiteral
qwirkle/src/domain/player.ts:96:10
   return result.players;
 };
 export const toChangeRack = (rack: RestRack): Rack => {
-  return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
+  return {};
 };
 export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
killedBy: player should return Rack with restRack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "code": 0,
-   "newRack": Array [],

[Killed] BlockStatement
qwirkle/src/domain/player.ts:98:81
 export const toChangeRack = (rack: RestRack): Rack => {
   return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
 };
-export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
-  return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
-};
+export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {};
 export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {
   return result.map<RestTilesSwap>(tile => ({playerId, tileId: tile.id}));
killedBy: player should return rack tile to play
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"playerId": 1, "tileId": 2, "x": 3, "y": -1}, {"playerId": 1, "tileId": 5, "x": 4, "y": -1}, {"playerId": 1, "tileId": 16, "x": 7, "y": 3}, {"playerId": 1, "tileId": 19, "x": 2, "y": 0}, {"playerId": 1, "tileId": 21, "x": 1, "y": 0}, {"playerId": 1, "tileId": 30, "x": 3, "y": 2}]
Received: undefined

[Killed] ArrowFunction
qwirkle/src/domain/player.ts:99:36
   return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
 };
 export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
-  return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
+  return result.map<RestTilesPlay>(() => undefined);
 };
 export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {
killedBy: player should return rack tile to play
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 36
+ Received  +  6

  Array [
-   Object {
-     "playerId": 1,

[Killed] ObjectLiteral
qwirkle/src/domain/player.ts:99:45
   return {code: rack.code, tilesPlayed: rack.tilesPlayed, newRack: rack.newRack, points: rack.points};
 };
 export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
-  return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
+  return result.map<RestTilesPlay>(tile => ({}));
 };
 export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {
killedBy: player should return rack tile to play
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 36
+ Received  +  6

  Array [
-   Object {
-     "playerId": 1,

[Killed] BlockStatement
qwirkle/src/domain/player.ts:101:79
 export const fromBoard = (result: Tile[], playerId: number): RestTilesPlay[] => {
   return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
 };
-export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {
-  return result.map<RestTilesSwap>(tile => ({playerId, tileId: tile.id}));
-};
+export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {};
 
 export interface Rack {
killedBy: player should return rack tile to swap
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"playerId": 1, "tileId": 2}, {"playerId": 1, "tileId": 5}, {"playerId": 1, "tileId": 16}, {"playerId": 1, "tileId": 19}, {"playerId": 1, "tileId": 21}, {"playerId": 1, "tileId": 30}]
Received: undefined

[Killed] ArrowFunction
qwirkle/src/domain/player.ts:102:36
   return result.map<RestTilesPlay>(tile => ({playerId, tileId: tile.id, x: tile.x, y: tile.y}));
 };
 export const fromBag = (result: Tile[], playerId: number): RestTilesSwap[] => {
-  return result.map<RestTilesSwap>(tile => ({playerId, tileId: tile.id}));
+  return result.map<RestTilesSwap>(() => undefined);
 };
 
killedBy: player should return rack tile to swap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  6

  Array [
-   Object {
-     "playerId": 1,
