[Killed] ArrowFunction
qwirkle/src/domain/tiles.ts:18:32
   X: number;
   Y: 0;
 }
-export const toTileviewModel = (player: Player): TileViewModel[] =>  player.rack.tiles
-  .map(tile => ({playerId: player.id, TileId: tile.id, X: tile.rackPosition, Y: 0}));
+export const toTileviewModel = () => undefined;
 
killedBy: AppComponent should rearrange rack 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"TileId": 71, "X": 5, "Y": 0, "playerId": 3}, {"TileId": 5, "X": 1, "Y": 0, "playerId": 3}, {"TileId": 31, "X": 0, "Y": 0, "playerId": 3}, {"TileId": 105, "X": 1, "Y": 0, "playerId": 3}, {"TileId": 77, "X": 2, "Y": 0, "playerId": 3}, {"TileId": 87, "X": 0, "Y": 0, "playerId": 3}]
Received: undefined

[Killed] ArrowFunction
qwirkle/src/domain/tiles.ts:19:8
   Y: 0;
 }
 export const toTileviewModel = (player: Player): TileViewModel[] =>  player.rack.tiles
-  .map(tile => ({playerId: player.id, TileId: tile.id, X: tile.rackPosition, Y: 0}));
+  .map(() => undefined);
 
killedBy: AppComponent should rearrange rack 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 36
+ Received  +  6

  Array [
-   Object {
-     "TileId": 71,
